In [1]:
import pandas as pd

In [2]:
customer_data = pd.read_csv("../noahs-customers.csv")

orders_data = pd.read_csv("../noahs-orders.csv")

contractor_number = "332-274-4185"

In [3]:
customer_data[customer_data["phone"] == contractor_number]

,customerid,name,address,citystatezip,birthdate,phone,timezone,lat,long
474,1475,Joshua Peterson,100-75 148th St,"Jamaica, NY 11435",1947-02-05,332-274-4185,America/New_York,40.70895,-73.80856

In [4]:
customer_data.dtypes

customerid        int64
name             object
address          object
citystatezip     object
birthdate        object
phone            object
timezone         object
lat             float64
long            float64
dtype: object

In [5]:
customer_data = customer_data[["customerid", "name", "birthdate", "phone", "citystatezip"]]

In [6]:
customer_birthdate_split = customer_data["birthdate"].str.split("-")

customer_data["birth_year"] = customer_birthdate_split.apply(lambda a: a[0])

customer_data["birth_day&month"] = customer_birthdate_split.apply(lambda a: a[1:])

In [7]:
customer_data["birth_year"] = customer_data["birth_year"].astype('int64')

In [8]:
customer_data.drop(columns=["birthdate"])

,customerid,name,phone,citystatezip,birth_year,birth_day&month
0,1001,Jacqueline Alvarez,315-377-5031,"Manhattan, NY 10013",1958,"[01, 23]"
1,1002,Julie Howell,680-537-8725,"Brooklyn, NY 11221",1956,"[12, 03]"
2,1003,Christopher Ali,315-846-6054,"Jamaica, NY 11434",2001,"[09, 20]"
3,1004,Christopher Rodriguez,516-275-2292,"Bronx, NY 10453",1959,"[07, 10]"
4,1005,Jeffrey Wilkinson,838-830-6960,"Manhattan, NY 10003",1988,"[09, 08]"
...,...,...,...,...,...,...
8255,9256,Leslie Johnson,914-511-7261,"Manhattan, NY 10035",1995,"[01, 02]"
8256,9257,Susan Gilmore,516-774-9355,"Bronx, NY 10472",1960,"[11, 11]"
8257,9258,Valerie Michelle Bowman,719-991-9904,"Denver, CO 80294",1992,"[02, 09]"
8258,9259,Sandy Rios,516-361-8507,"Jamaica, NY 11435",1954,"[05, 02]"
8259,9260,Michael Brooks,415-339-0869,"Hesperia, CA 92344",1945,"[09, 26]"

In [9]:
customer_data = customer_data[customer_data["birth_year"].mod(12) == 7]

In [11]:
def cancer_birth_daymonth(daymonth_list: list[str]) -> bool:

    month = int(daymonth_list[0])

    day = int(daymonth_list[1])

    if month == 6 and day >= 21:
        return True
    if month == 7 and day <= 22:
        return True
    
    return False

In [12]:
customer_data = customer_data[customer_data["birth_day&month"].apply(cancer_birth_daymonth) == True]

In [13]:
customer_data = customer_data[customer_data["citystatezip"].str.contains("Jamaica, NY 11435")]

customer_data.head()

,customerid,name,birthdate,phone,citystatezip,birth_year,birth_day&month
1549,2550,Robert Morton,1999-07-08,917-288-9635,"Jamaica, NY 11435",1999,"[07, 08]"